#!/usr/bin/env python3
"""
Генератор тестовых PDF для проверки пайплайна

Создаёт несколько тестовых PDF документов в формате НПА
для проверки работы парсера
"""

from reportlab.lib.pagesizes import A4
from reportlab.pdfgen import canvas
from reportlab.pdfbase import pdfmetrics
from reportlab.pdfbase.ttfonts import TTFont
from reportlab.lib.units import cm
from pathlib import Path


def create_test_npa_pdf(output_path: str, doc_info: dict):
    """
    Создать тестовый PDF документ НПА

    Args:
        output_path: Путь для сохранения PDF
        doc_info: Информация о документе (тип, номер, название и т.д.)
    """
    c = canvas.Canvas(output_path, pagesize=A4)
    width, height = A4

    # Настройка шрифта
    try:
        # Пробуем использовать системный шрифт
        c.setFont("Helvetica", 12)
    except:
        c.setFont("Helvetica", 12)

    y = height - 3*cm

    # Заголовок документа
    c.setFont("Helvetica-Bold", 14)
    c.drawCentredString(width/2, y, doc_info['doc_type'])
    y -= 1*cm

    c.setFont("Helvetica", 12)
    c.drawCentredString(width/2, y, f"от {doc_info['date']} N {doc_info['number']}")
    y -= 1.5*cm

    c.setFont("Helvetica-Bold", 12)
    c.drawCentredString(width/2, y, doc_info['title'])
    y -= 1.5*cm

    # Преамбула
    if 'preamble' in doc_info:
        c.setFont("Helvetica", 10)
        lines = doc_info['preamble'].split('\n')
        for line in lines:
            if y < 2*cm:
                c.showPage()
                y = height - 2*cm
                c.setFont("Helvetica", 10)
            c.drawString(2*cm, y, line)
            y -= 0.5*cm
        y -= 0.5*cm

    # Главы и статьи
    for chapter in doc_info.get('chapters', []):
        # Глава
        if y < 3*cm:
            c.showPage()
            y = height - 2*cm

        c.setFont("Helvetica-Bold", 11)
        c.drawString(2*cm, y, f"Глава {chapter['number']}. {chapter['title']}")
        y -= 1*cm

        # Статьи главы
        for article in chapter.get('articles', []):
            if y < 4*cm:
                c.showPage()
                y = height - 2*cm
                c.setFont("Helvetica", 10)

            c.setFont("Helvetica-Bold", 10)
            c.drawString(2*cm, y, f"Статья {article['number']}. {article['title']}")
            y -= 0.7*cm

            # Части статьи
            c.setFont("Helvetica", 10)
            for i, part in enumerate(article.get('parts', []), 1):
                if y < 2*cm:
                    c.showPage()
                    y = height - 2*cm
                    c.setFont("Helvetica", 10)

                # Разбиваем длинный текст на строки
                part_lines = []
                words = part.split()
                current_line = f"{i}. "
                for word in words:
                    test_line = current_line + word + " "
                    if c.stringWidth(test_line, "Helvetica", 10) < (width - 4*cm):
                        current_line = test_line
                    else:
                        part_lines.append(current_line)
                        current_line = "   " + word + " "
                if current_line.strip():
                    part_lines.append(current_line)

                for line in part_lines:
                    if y < 1.5*cm:
                        c.showPage()
                        y = height - 2*cm
                        c.setFont("Helvetica", 10)
                    c.drawString(2.5*cm, y, line)
                    y -= 0.5*cm

                y -= 0.2*cm

            y -= 0.3*cm

    c.save()
    print(f"✅ Создан: {output_path}")


def main():
    """Создание тестовых PDF документов"""
    output_dir = Path("data/input/codex")
    output_dir.mkdir(parents=True, exist_ok=True)

    print("🔧 Генерация тестовых PDF документов НПА\n")

    # Тест 1: Короткий закон
    test_doc_1 = {
        'doc_type': 'ФЕДЕРАЛЬНЫЙ ЗАКОН',
        'number': '1-ФЗ',
        'date': '1 января 2020 г.',
        'title': 'О тестировании парсера НПА',
        'preamble': 'Принят Государственной Думой 20 декабря 2019 года\nОдобрен Советом Федерации 25 декабря 2019 года',
        'chapters': [
            {
                'number': 1,
                'title': 'ОБЩИЕ ПОЛОЖЕНИЯ',
                'articles': [
                    {
                        'number': '1',
                        'title': 'Предмет регулирования настоящего Федерального закона',
                        'parts': [
                            'Настоящий Федеральный закон устанавливает правовые основы тестирования парсеров документов нормативно-правовых актов.',
                            'Целями настоящего Федерального закона являются обеспечение качества программного обеспечения и проверка корректности работы парсеров.'
                        ]
                    },
                    {
                        'number': '2',
                        'title': 'Основные понятия',
                        'parts': [
                            'Для целей настоящего Федерального закона используются следующие основные понятия: парсер - программа для извлечения структурированных данных из документов.',
                            'Тестирование - процесс проверки соответствия программы установленным требованиям.',
                            'Нормативно-правовой акт - официальный документ, принятый уполномоченным органом государственной власти.'
                        ]
                    }
                ]
            },
            {
                'number': 2,
                'title': 'ПОРЯДОК ТЕСТИРОВАНИЯ',
                'articles': [
                    {
                        'number': '3',
                        'title': 'Проведение тестирования',
                        'parts': [
                            'Тестирование парсера осуществляется путем обработки тестовых документов и проверки корректности результатов.',
                            'При обнаружении ошибок в работе парсера производится их исправление и повторное тестирование.'
                        ]
                    }
                ]
            }
        ]
    }

    create_test_npa_pdf(str(output_dir / "TEST_закон_1_ФЗ.pdf"), test_doc_1)

    # Тест 2: Постановление
    test_doc_2 = {
        'doc_type': 'ПОСТАНОВЛЕНИЕ ПРАВИТЕЛЬСТВА РОССИЙСКОЙ ФЕДЕРАЦИИ',
        'number': '100',
        'date': '15 марта 2021 г.',
        'title': 'Об утверждении Правил тестирования',
        'chapters': [
            {
                'number': 1,
                'title': 'ОБЩИЕ ПОЛОЖЕНИЯ',
                'articles': [
                    {
                        'number': '1',
                        'title': 'Область применения',
                        'parts': [
                            'Настоящие Правила устанавливают порядок проведения тестирования программного обеспечения для парсинга нормативно-правовых актов.'
                        ]
                    }
                ]
            }
        ]
    }

    create_test_npa_pdf(str(output_dir / "TEST_постановление_100.pdf"), test_doc_2)

    # Тест 3: Приказ
    test_doc_3 = {
        'doc_type': 'ПРИКАЗ',
        'number': '50н',
        'date': '10 мая 2022 г.',
        'title': 'О проведении проверки парсеров',
        'chapters': [
            {
                'number': 1,
                'title': 'ПОРЯДОК ПРОВЕРКИ',
                'articles': [
                    {
                        'number': '1',
                        'title': 'Этапы проверки',
                        'parts': [
                            'Проверка парсера включает следующие этапы: подготовка тестовых данных, запуск парсера, анализ результатов.',
                            'По результатам проверки составляется отчет о выявленных недостатках и рекомендациях по их устранению.'
                        ]
                    }
                ]
            }
        ]
    }

    create_test_npa_pdf(str(output_dir / "TEST_приказ_50н.pdf"), test_doc_3)

    print(f"\n✅ Создано {3} тестовых PDF файлов в: {output_dir}")
    print("\nГотово! Теперь можно запустить:")
    print("  python pipeline_codex.py")


if __name__ == "__main__":
    try:
        main()
    except ImportError as e:
        print(f"❌ Ошибка: Не установлена библиотека reportlab")
        print("   Установите: pip install reportlab")
        import sys
        sys.exit(1)
